Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.longhorn_system.aws_s3_bucket.longhorn_backups has been deleted
- resource "aws_s3_bucket" "longhorn_backups" {
      - arn                         = "arn:aws:s3:::longhorn-backups.billv.ca" -> null
      - id                          = "longhorn-backups.billv.ca" -> null
      - region                      = "us-east-1" -> null
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # module.atlantis.aws_iam_user_policy.atlantis will be updated in-place
~ resource "aws_iam_user_policy" "atlantis" {
        id          = "atlantis:atlantis"
        name        = "atlantis"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:s3:::tfstate.billv.ca/*",
                          + "arn:aws:s3:::longhorn-backups.billv.ca",
                          + "arn:aws:s3:::longhorn-backups.billv.ca/*",
                        ]
                        # (3 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "ssm:GetParameter",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/webhook-secret",
                            "arn:aws:ssm:us-east-1:398183381961:parameter/zoho-smtp-creds",
                            "arn:aws:ssm:us-east-1:398183381961:parameter/runatlantis/key",
                        ]
                        Sid      = "GrantAtlantisSSMAccess"
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.longhorn_system.aws_iam_user_policy.s3 will be updated in-place
~ resource "aws_iam_user_policy" "s3" {
        id          = "longhorn:longhorn-s3"
        name        = "longhorn-s3"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                          - "s3:ListBucket",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::longhorn-backups.billv.ca",
                          - "arn:aws:s3:::longhorn-backups.billv.ca/*",
                        ]
                      - Sid      = "GrantLonghornBackupstoreAccess0"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.longhorn_system.aws_s3_bucket.longhorn_backups will be created
+ resource "aws_s3_bucket" "longhorn_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "longhorn-backups.billv.ca"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.longhorn_system.helm_release.longhorn will be updated in-place
~ resource "helm_release" "longhorn" {
        id                         = "longhorn"
      ~ metadata                   = [
          - {
              - app_version    = "v1.8.1"
              - chart          = "longhorn"
              - first_deployed = 1732591142
              - last_deployed  = 1742407227
              - name           = "longhorn"
              - namespace      = "longhorn-system"
              - notes          = <<-EOT
                    Longhorn is now installed on the cluster!
                    
                    Please wait a few minutes for other Longhorn components such as CSI deployments, Engine Images, and Instance Managers to be initialized.
                    
                    Visit our documentation at https://longhorn.io/docs/
                EOT
              - revision       = 8
              - values         = jsonencode(
                    {
                      - defaultSettings = {
                          - backupTarget                 = "s3://longhorn-backups.billv.ca@us-east-1/"
                          - backupTargetCredentialSecret = "longhorn-backups-credentials"
                          - backupstorePollInterval      = 0
                        }
                    }
                )
              - version        = "1.8.1"
            },
        ] -> (known after apply)
        name                       = "longhorn"
        # (26 unchanged attributes hidden)

      - set {
          - name  = "defaultSettings.backupTarget" -> null
          - value = "s3://longhorn-backups.billv.ca@us-east-1/" -> null
            # (1 unchanged attribute hidden)
        }
      + set {
          + name  = "defaultSettings.backupTarget"
          + value = (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 3 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d .
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis.billv.ca/lock?id=bbl232%252Fhomelab-k3s-base-services%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d .
  ```

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 3 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```